<?php

use Illuminate\Support\Facades\Route;

Route::view('/', 'index')->name('index');
Route::get('/steam/login', [\App\Http\Controllers\SteamController::class, 'login'])->name('steam.login');

# TODO при клике в турнирной сетке переходить на страницу клана!
# TODO все данные из БД!!!!!
# TODO реальные сервера из БД!!!!

Route::get('/notifications', function (){
    return "Уведомления";
})->name('notifications');

Route::get('/chats', function (){
    return "Список чатов";
})->name('chat.index');

Route::get('/profile', function (){
    return "Профиль";
})->name('profile.index');

Route::get('/logout', function (){
    return "Выйти";
})->name('logout');

Route::get('/mix', function (){
    // Сервера с сортировкой
    // А так же статистика юзера!
    return "Микс";
})->name('mix.index');

Route::get('/clan-war', function (){
    // Нужно отображать тех, кто онлайн! Отправить им приглашение в лобби!
    // Владелец клана может создать клан. Выбрав участнинов и карту. Затем участиники должны подтвердить и начнется поиск
    // Если хотя бы один не подтвердил, то клан не может начать поиск + если кто-то отменит тоже самое!
    return "Битва кланов";
})->name('cw.index');

Route::get('/tournaments', function (){
    return "Туринры";
})->name('tournament.index');

Route::get('/clan-ratings', function (){
    return "Рейтинг кланов";
})->name('clan.ratings');

/*
 * TODO
 * ПЕРЕДЕЛАТЬ ТАБЛИЦЫ С 0! РЕФАКТОР
 * ПОТОМУ ЧТО!
 * Где мне хранить статистику?
Где модели для чата?
Где посмотреть поданные заявки в кланы?
Где хранится избранное?

БУДЕМ ЧАТУ ГПТ СКАРМЛИВАТЬ КАЖДУЮ ТАБЛИЦУ ОТДЕЛЬНО ПО ОПИСАНИЮ А ЗАТЕМ РЕДАЧИМ ЕЕ САМИМ!
ЗАТЕМ МОДЕЛИРУЕМ СИТУАЦИЮ И ПРОВЕРЯЕМ ПО ТАБЛИЦАМ!!! НАПРИМЕР Я ВЫЙГРАЛ МАТЧ и ТД
ХРАНИТЬ РЕЗУЛЬТАТ В JSON БРЕД, ОНОВНЫЕ ДАННЫЕ НАДО ВЫНОСИТЬ, что бы поиск был по ним
||||

ПРОТЕСТИТЬ СРАЗУ В seeder
- Админ создает туринр.
- набираем 8 команд например
- автоматическая жеребьевка (создаем рандомно матчи и откладываем им начало!)
- ВСЕ!

ПРИ ПОБЕДЕ В КВ МЫ ДАЕМ ОТЧКИ САМОМУ КЛАНУ + ИГРОКАМ CW_RANK
 */
